ðŸš¦ Lab 3: Router-on-a-Stick (VLAN Routing)
This lab mimics how VLANs in different subnets talk to each otherâ€”something youâ€™ll see everywhere in real-world networks. We're now combining Layer 2 segmentation with Layer 3 inter-VLAN routing.

ðŸ§° Topology:
1 Router

1 Switch

2 PCs

VLANs:

VLAN 10 â€“ Accounting â†’ 192.168.10.0/24

VLAN 20 â€“ HR â†’ 192.168.20.0/24

âš™ï¸ Step-by-Step Lab Guide
ðŸ”Œ 1. Wiring and IP Assignment
Device	Port	IP Address	VLAN
PC0	Fa0	192.168.10.10/24	10
PC1	Fa0	192.168.20.10/24	20
Router	G0/0	Trunk connection	N/A

ðŸ”§ 2. Switch Configuration
bash
Copy
Edit
Switch> enable
Switch# configure terminal

# VLAN Creation
Switch(config)# vlan 10
Switch(config-vlan)# name Accounting
Switch(config-vlan)# exit

Switch(config)# vlan 20
Switch(config-vlan)# name HR
Switch(config-vlan)# exit

# Assign ports to VLANs
Switch(config)# interface fa0/1
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 10
Switch(config-if)# exit

Switch(config)# interface fa0/2
Switch(config-if)# switchport mode access
Switch(config-if)# switchport access vlan 20
Switch(config-if)# exit

# Configure trunk to router
Switch(config)# interface fa0/24
Switch(config-if)# switchport trunk encapsulation dot1q
Switch(config-if)# switchport mode trunk
Switch(config-if)# exit
ðŸ–§ 3. Router Configuration (Router-on-a-Stick)
bash
Copy
Edit
Router> enable
Router# configure terminal

# Subinterfaces for VLANs
Router(config)# interface g0/0.10
Router(config-subif)# encapsulation dot1Q 10
Router(config-subif)# ip address 192.168.10.1 255.255.255.0
Router(config-subif)# exit

Router(config)# interface g0/0.20
Router(config-subif)# encapsulation dot1Q 20
Router(config-subif)# ip address 192.168.20.1 255.255.255.0
Router(config-subif)# exit

# Activate the physical interface
Router(config)# interface g0/0
Router(config-if)# no shutdown
Router(config-if)# exit
ðŸ§ª 4. Test the Network
PC0 should ping PC1 successfully.

Both PCs should be able to ping their gateway (192.168.10.1 and 192.168.20.1).

